app/views/comments/create.js.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]
---
$('#comment_count').html("<h2><%= @post.comments.count %> Comments</h2>");