app/views/comments/manage_comment.html.erb

<% @post.comments.each do |comment|%>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 2]]