app/views/posts/profile.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 2]]
---

	<% @user.posts.each do |post| %>