app/views/posts/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
	<p class="date">
	<%= link_to @post.user.email.split('@').first, profile_post_path(@post) %>	Submitted <%= time_ago_in_words(@post.created_at) %> Ago

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 2]]
---
	<div id="comments">
		<div><h2><%= @post.comments.count %> Comments</h2></div>