app/controllers/dashboards_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 2]]
---
  def index
    @posts = Post.where(user_id: current_user.id)