app/controllers/pages_controller.rb

  def about
    @user = User.find(current_user.id)
    @posts = Post.where(user_id: @user.id)
    @comments = Comment.where(user_id: @user.id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 2]]