app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."status" = ? ORDER BY created_at DESC  [["status", 1]]
---
	def index
		@posts = Post.where(status: true).order('created_at DESC')

INSERT INTO "posts" ("title", "body", "created_at", "updated_at", "user_id", "status") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "emreee"], ["body", "wqerqwerwre"], ["created_at", "2021-10-22 06:10:55.525003"], ["updated_at", "2021-10-22 06:10:55.525003"], ["user_id", 1], ["status", true]]
---
	def create
		@post = Post.new(post_params)
		@post.user_id = current_user.id

		if @post.save

UPDATE "posts" SET "updated_at" = ?, "status" = ? WHERE "posts"."id" = ?  [["updated_at", "2021-10-18 01:16:21.645481"], ["status", 1], ["id", 3]]
---
	def update
		set_post

		if @post.update(post_params)

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]
---
	def destroy
		set_post
		@post.destroy

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 2]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
	def profile
		set_post
		@posts = Post.where(user_id: @post.user_id, visible: true)

		@posts = Post.where(user_id: @post.user_id) if @post.user_id == current_user.id
		@my_profile = true if @post.user_id == current_user.id

		@user = User.find(@post.user_id)