app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1 AND "posts"."status" = $2  [["user_id", 1], ["status", true]]
---
  def show
    @user = User.find(params[:id])
    @posts = Post.where(user_id: @user.id, status: true)